app/Controllers/Main.php

SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `vacancies`
SELECT COUNT(*) AS `numrows` FROM `applicants`
---
    public function index()
    {
        $this->data['page_title'] = "Home";
        $this->data['departments'] = $this->department_model->countAll();
        $this->data['vacancies'] = $this->vacancy_model->countAll();
        $this->data['applicants'] = $this->applicant_model->countAll();

SELECT *
FROM `users`
WHERE `id` != '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '1'
---
    public function users()
    {
        $this->data['page_title'] = "Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `departments`
SELECT *
FROM `departments`
 LIMIT 10
---
    public function departments()
    {
        $this->data['page_title'] = "Departments";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->department_model->countAllResults();
        $this->data['departments'] = $this->department_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `vacancies`
SELECT COUNT(*) AS `numrows`
FROM `vacancies`
INNER JOIN `departments` ON `vacancies`.`department_id` = `departments`.`id`
---
    public function vacancies()
    {
        $this->data['page_title'] = "Vacancies";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        if (!empty($this->request->getVar('search'))) {
            $search = $this->request->getVar('search');
            $this->vacancy_model->where(" vacancies.position LIKE '%{$search}%' or vacancies.description LIKE '%{$search}%'");
        }
        $this->data['total'] =  $this->vacancy_model->countAllResults();
        if (!empty($this->request->getVar('search'))) {
            $search = $this->request->getVar('search');
            $this->vacancy_model->where(" vacancies.position LIKE '%{$search}%' or vacancies.description LIKE '%{$search}%'");
        }
        $this->data['vacancies'] = $this->vacancy_model
            ->select("vacancies.*, departments.name as department, (vacancies.slot - COALESCE((SELECT COUNT(id) FROM applicants where vacancy_id = vacancies.id and status = 1), 0)) as available")
            ->join("departments", "vacancies.department_id = departments.id", "inner")
            ->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `applicants`
SELECT COUNT(*) AS `numrows`
FROM `applicants`
INNER JOIN `vacancies` ON `applicants`.`vacancy_id` = `vacancies`.`id`
INNER JOIN `departments` ON `vacancies`.`department_id` = `departments`.`id`
SELECT `applicants`.*, CONCAT(applicants.last_name, ', ', `applicants`.`first_name`, ' ', COALESCE(CONCAT(' ', applicants.middle_name), '')) as `name`, `vacancies`.`position`, `departments`.`name` as `department`
FROM `applicants`
INNER JOIN `vacancies` ON `applicants`.`vacancy_id` = `vacancies`.`id`
INNER JOIN `departments` ON `vacancies`.`department_id` = `departments`.`id`
 LIMIT 10
---
    public function applicants()
    {
        $this->data['page_title'] = "Applicants";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->applicant_model->countAllResults();
        $this->data['applicants'] = $this->applicant_model
            ->select("applicants.*, CONCAT(applicants.last_name,', ',applicants.first_name,' ',COALESCE(CONCAT(' ', applicants.middle_name), '')) as `name` , vacancies.position, departments.name as department")
            ->join("vacancies", "applicants.vacancy_id = vacancies.id", "inner")
            ->join("departments", "vacancies.department_id = departments.id", "inner")
            ->paginate($this->data['perPage']);