app/Controllers/Vacancy.php

    public function index()
    {
        $this->data['page_title'] = "Vacancy";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  5;
        $this->data['total'] =  $this->vacancy_model->where('status', 1)
                                ->orderBy('abs(unix_timestamp(created_at)) DESC')
                                ->countAllResults();
        $this->data['vacancies'] = $this->vacancy_model
                                ->select("vacancies.*, departments.name as department, (vacancies.slot - COALESCE((SELECT COUNT(id) FROM applicants where vacancy_id = vacancies.id and status = 1), 0)) as available")
                                ->where('vacancies.status', 1)
                                ->join('departments',"vacancies.department_id = departments.id", "inner")
                                ->orderBy('abs(unix_timestamp(vacancies.created_at)) DESC')
                                ->paginate($this->data['perPage']);
---
SELECT COUNT(*) AS `numrows`
FROM `vacancies`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `vacancies`
INNER JOIN `departments` ON `vacancies`.`department_id` = `departments`.`id`
WHERE `vacancies`.`status` = 1